---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.WallAMLostAdjustmentReference
source: html/d8062879-02c7-dcd9-2852-a44a7768b68f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.WallAMLostAdjustmentReference Property

Wall Analytical Model has lost its adjustment reference.

## Syntax (C#)
```csharp
public static FailureDefinitionId WallAMLostAdjustmentReference { get; }
```